# Pandas Datatype
## pandas.Series
1. strictly homo and 1-D data structures
2. No need to apply loops and if for conditions
3. uses [] to access elements by indexes
4. indexes can be numbers or text

## pandas.DataFrame
1. 2-D data structures
2. combo of multiple series
3. Equiv to regular tables

In [2]:
import pandas as pd

In [3]:
l1 = [12,34,56,32,12,3,4,57,54,46,56,78,99,100,23]
print(l1)

ser1 = pd.Series(l1)
print(ser1)

[12, 34, 56, 32, 12, 3, 4, 57, 54, 46, 56, 78, 99, 100, 23]
0      12
1      34
2      56
3      32
4      12
5       3
6       4
7      57
8      54
9      46
10     56
11     78
12     99
13    100
14     23
dtype: int64

In [4]:
# for pd.Series, indexes can also be user defined
ser2 = pd.Series(l1, index= range(1,len(l1)+1))
# index takes a list as input - 
#        i. elements should be unique
#        ii. the size of the list should be same as the size of the series
print(ser2)

1      12
2      34
3      56
4      32
5      12
6       3
7       4
8      57
9      54
10     46
11     56
12     78
13     99
14    100
15     23
dtype: int64

In [5]:
ser3 = pd.Series(l1, index = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 0, 'j', 23, 2, 'word_idx', 'z', 1])
print(ser3)

a            12
b            34
c            56
d            32
e            12
f             3
g             4
h            57
0            54
j            46
23           56
2            78
word_idx     99
z           100
1            23
dtype: int64

index to series can be 

1. Default (.iloc[]) 0 to n-1. It stays forever internally. If user doesnt define its own index, then both int and ext idx are from 0 to n-1, n:number of elements in series
2. User defined (.loc[]). Ext index is same as of user defined. Int idx is 0 to n-1. loc supports internal index but if ext idx is defined, then loc wont support ext idx. Hence, unless ext idx is defined, loc is preffered for both row and col fetching

In [6]:
ser4 = pd.Series(l1, index=['a','b','c','d','e','f','g','h','i','j','k','l','m','n','o'])
ser4.loc['a']
# ser4.loc[0]       it wont work

12

In [7]:
print(l1[3])
# ser2
# access fourth element - element with def index as 3
print(ser3.iloc[3], ser3.loc[0], ser3[1])
print(ser3['word_idx'])

32
32 54 23
99

In [8]:
print(ser1.iloc[0:8])   # rhl will be omitted. ser1 dont have ext idx
print(ser2.iloc[0:8])   # rhl will be omitted. ser2 have ext idx
# both will give seven rows, but the internal indexing is same in both series. On printing, ext idx overrides to display in ser2.

0    12
1    34
2    56
3    32
4    12
5     3
6     4
7    57
dtype: int64
1    12
2    34
3    56
4    32
5    12
6     3
7     4
8    57
dtype: int64

In [9]:
print(ser2.iloc[0:80])  # only int idx which are valid within range wll be displayed without errors

1      12
2      34
3      56
4      32
5      12
6       3
7       4
8      57
9      54
10     46
11     56
12     78
13     99
14    100
15     23
dtype: int64

In [10]:
print(ser2.loc[1:9]) # Contrary to the regular 1,2,3,4,5,6,7,8 a colon op in .loc will get 1,2,3,4,5,6,7,8,9
print(ser2.loc[0:90])  # only the valid row with ext idx within the range will be displayed without throwing any errors

1    12
2    34
3    56
4    32
5    12
6     3
7     4
8    57
9    54
dtype: int64
1      12
2      34
3      56
4      32
5      12
6       3
7       4
8      57
9      54
10     46
11     56
12     78
13     99
14    100
15     23
dtype: int64

#### Applying conditions to series

In [11]:
ser1 > 30

0     False
1      True
2      True
3      True
4     False
5     False
6     False
7      True
8      True
9      True
10     True
11     True
12     True
13     True
14    False
dtype: bool

In [12]:
ser1[ser1 > 30]

1      34
2      56
3      32
7      57
8      54
9      46
10     56
11     78
12     99
13    100
dtype: int64

In [13]:
ser1[(ser1 > 30) & (ser1 < 80)] # comparision happens on series

#and &
#or  |
#not ~

1     34
2     56
3     32
7     57
8     54
9     46
10    56
11    78
dtype: int64

In [14]:
ser1.loc[(ser1 > 30) & (ser1 < 80)]
# mentioning .loc is the conventional way of applying the conditions, because loc can take boolean values. iloc cant take boolean values.

1     34
2     56
3     32
7     57
8     54
9     46
10    56
11    78
dtype: int64

### Functions associated with series

In [15]:
print(dir(ser1))

['T', '_AXIS_LEN', '_AXIS_ORDERS', '_AXIS_REVERSED', '_AXIS_TO_AXIS_NUMBER', '_HANDLED_TYPES', '__abs__', '__add__', '__and__', '__annotations__', '__array__', '__array_priority__', '__array_ufunc__', '__array_wrap__', '__bool__', '__class__', '__contains__', '__copy__', '__deepcopy__', '__delattr__', '__delitem__', '__dict__', '__dir__', '__divmod__', '__doc__', '__eq__', '__finalize__', '__float__', '__floordiv__', '__format__', '__ge__', '__getattr__', '__getattribute__', '__getitem__', '__getstate__', '__gt__', '__hash__', '__iadd__', '__iand__', '__ifloordiv__', '__imod__', '__imul__', '__init__', '__init_subclass__', '__int__', '__invert__', '__ior__', '__ipow__', '__isub__', '__iter__', '__itruediv__', '__ixor__', '__le__', '__len__', '__long__', '__lt__', '__matmul__', '__mod__', '__module__', '__mul__', '__ne__', '__neg__', '__new__', '__nonzero__', '__or__', '__pos__', '__pow__', '__radd__', '__rand__', '__rdivmod__', '__reduce__', '__reduce_ex__', '__repr__', '__rfloordiv__', '__rmatmul__', '__rmod__', '__rmul__', '__ror__', '__round__', '__rpow__', '__rsub__', '__rtruediv__', '__rxor__', '__setattr__', '__setitem__', '__setstate__', '__sizeof__', '__str__', '__sub__', '__subclasshook__', '__truediv__', '__weakref__', '__xor__', '_accessors', '_accum_func', '_add_numeric_operations', '_agg_by_level', '_agg_examples_doc', '_agg_see_also_doc', '_align_frame', '_align_series', '_arith_method', '_attrs', '_binop', '_builtin_table', '_can_hold_na', '_check_inplace_and_allows_duplicate_labels', '_check_inplace_setting', '_check_is_chained_assignment_possible', '_check_label_or_level_ambiguity', '_check_setitem_copy', '_clear_item_cache', '_clip_with_one_bound', '_clip_with_scalar', '_cmp_method', '_consolidate', '_consolidate_inplace', '_construct_axes_dict', '_construct_axes_from_arguments', '_construct_result', '_constructor', '_constructor_expanddim', '_constructor_sliced', '_convert', '_convert_dtypes', '_cython_table', '_data', '_dir_additions', '_dir_deletions', '_drop_axis', '_drop_labels_or_levels', '_find_valid_index', '_flags', '_get_axis', '_get_axis_name', '_get_axis_number', '_get_axis_resolvers', '_get_block_manager_axis', '_get_bool_data', '_get_cacher', '_get_cleaned_column_resolvers', '_get_cython_func', '_get_index_resolvers', '_get_item_cache', '_get_label_or_level_values', '_get_numeric_data', '_get_value', '_get_values', '_get_values_tuple', '_get_with', '_gotitem', '_hidden_attrs', '_index', '_indexed_same', '_info_axis', '_info_axis_name', '_info_axis_number', '_init_dict', '_init_mgr', '_inplace_method', '_internal_names', '_internal_names_set', '_is_builtin_func', '_is_cached', '_is_copy', '_is_label_or_level_reference', '_is_label_reference', '_is_level_reference', '_is_mixed_type', '_is_view', '_iset_item', '_item_cache', '_ix', '_ixs', '_logical_func', '_logical_method', '_map_values', '_maybe_cache_changed', '_maybe_update_cacher', '_metadata', '_mgr', '_min_count_stat_function', '_name', '_needs_reindex_multi', '_obj_with_exclusions', '_protect_consolidate', '_reduce', '_reindex_axes', '_reindex_indexer', '_reindex_multi', '_reindex_with_indexers', '_replace_single', '_repr_data_resource_', '_repr_latex_', '_reset_cache', '_reset_cacher', '_selected_obj', '_selection', '_selection_list', '_selection_name', '_set_as_cached', '_set_axis', '_set_axis_name', '_set_axis_nocheck', '_set_is_copy', '_set_item', '_set_labels', '_set_name', '_set_value', '_set_values', '_set_with', '_set_with_engine', '_slice', '_stat_axis', '_stat_axis_name', '_stat_axis_number', '_stat_function', '_stat_function_ddof', '_take_with_is_copy', '_to_dict_of_blocks', '_try_aggregate_string_function', '_typ', '_update_inplace', '_validate_dtype', '_values', '_where', 'abs', 'add', 'add_prefix', 'add_suffix', 'agg', 'aggregate', 'align', 'all', 'any', 'append', 'apply', 'argmax', 'argmin', 'argsort', 'array', 'asfreq', 'asof', 'astype', 'at', 'at_time', 'attrs', 'autocorr', 'axes', 'backfill', 'between', 'between_time', 'bfill', 'bool', 'clip', 'combine', 'combine_first', 'compare', 'convert_dtypes', 'copy', 'corr', 'count', 'cov', 'cummax', 'cummin', 'cumprod', 'cumsum', 'describe', 'diff', 'div', 'divide', 'divmod', 'dot', 'drop', 'drop_duplicates', 'droplevel', 'dropna', 'dtype', 'dtypes', 'duplicated', 'empty', 'eq', 'equals', 'ewm', 'expanding', 'explode', 'factorize', 'ffill', 'fillna', 'filter', 'first', 'first_valid_index', 'flags', 'floordiv', 'ge', 'get', 'groupby', 'gt', 'hasnans', 'head', 'hist', 'iat', 'idxmax', 'idxmin', 'iloc', 'index', 'infer_objects', 'interpolate', 'is_monotonic', 'is_monotonic_decreasing', 'is_monotonic_increasing', 'is_unique', 'isin', 'isna', 'isnull', 'item', 'items', 'iteritems', 'keys', 'kurt', 'kurtosis', 'last', 'last_valid_index', 'le', 'loc', 'lt', 'mad', 'map', 'mask', 'max', 'mean', 'median', 'memory_usage', 'min', 'mod', 'mode', 'mul', 'multiply', 'name', 'nbytes', 'ndim', 'ne', 'nlargest', 'notna', 'notnull', 'nsmallest', 'nunique', 'pad', 'pct_change', 'pipe', 'plot', 'pop', 'pow', 'prod', 'product', 'quantile', 'radd', 'rank', 'ravel', 'rdiv', 'rdivmod', 'reindex', 'reindex_like', 'rename', 'rename_axis', 'reorder_levels', 'repeat', 'replace', 'resample', 'reset_index', 'rfloordiv', 'rmod', 'rmul', 'rolling', 'round', 'rpow', 'rsub', 'rtruediv', 'sample', 'searchsorted', 'sem', 'set_axis', 'set_flags', 'shape', 'shift', 'size', 'skew', 'slice_shift', 'sort_index', 'sort_values', 'squeeze', 'std', 'sub', 'subtract', 'sum', 'swapaxes', 'swaplevel', 'tail', 'take', 'to_clipboard', 'to_csv', 'to_dict', 'to_excel', 'to_frame', 'to_hdf', 'to_json', 'to_latex', 'to_list', 'to_markdown', 'to_numpy', 'to_period', 'to_pickle', 'to_sql', 'to_string', 'to_timestamp', 'to_xarray', 'transform', 'transpose', 'truediv', 'truncate', 'tz_convert', 'tz_localize', 'unique', 'unstack', 'update', 'value_counts', 'values', 'var', 'view', 'where', 'xs']

In [16]:
ser1.sum()

666

In [17]:
ser1.mean()

44.4

In [18]:
ser1.median()

46.0

In [19]:
ser1.mode() # always gives a dataframe, even if only one mode is possible

0    12
1    56
dtype: int64

In [20]:
ser1.min()

3

In [21]:
ser1.max()

100

In [74]:
ser1.quantile([0,0.25,0.5,0.75,0.65,1]) # gives percentile values, not just limited to quantiles and min&max

0.00      3.0
0.25     17.5
0.50     46.0
0.75     56.5
0.65     56.0
1.00    100.0
dtype: float64

In [23]:
ser1.describe()

count     15.000000
mean      44.400000
std       31.497846
min        3.000000
25%       17.500000
50%       46.000000
75%       56.500000
max      100.000000
dtype: float64

In [24]:
#  pd.to_numeric(ser1)        any data type to numbers
#  pd.to_datetime()       suitable characters to date type
# --------------------------------------------------------------
# dataframe.astype(str)   anything(DF or S or DF.S.....) to string (object type)
# dataframe.astype(bool)  anything(DF or S or DF.col...) to bool

In [25]:
ser1.astype(bool)

0     True
1     True
2     True
3     True
4     True
5     True
6     True
7     True
8     True
9     True
10    True
11    True
12    True
13    True
14    True
dtype: bool

In [26]:
ser1.astype(int)

0      12
1      34
2      56
3      32
4      12
5       3
6       4
7      57
8      54
9      46
10     56
11     78
12     99
13    100
14     23
dtype: int64

In [27]:
ser1.astype(float)

0      12.0
1      34.0
2      56.0
3      32.0
4      12.0
5       3.0
6       4.0
7      57.0
8      54.0
9      46.0
10     56.0
11     78.0
12     99.0
13    100.0
14     23.0
dtype: float64

In [28]:
ser1.astype(object)

0      12
1      34
2      56
3      32
4      12
5       3
6       4
7      57
8      54
9      46
10     56
11     78
12     99
13    100
14     23
dtype: object

In [29]:
ser1.clip?

Signature:
ser1.clip(
    lower=None,
    upper=None,
    axis=None,
    inplace: 'bool_t' = False,
    *args,
    **kwargs,
) -> 'FrameOrSeries'
Docstring:
Trim values at input threshold(s).

Assigns values outside boundary to boundary values. Thresholds
can be singular values or array like, and in the latter case
the clipping is performed element-wise in the specified axis.

Parameters
----------
lower : float or array_like, default None
    Minimum threshold value. All values below this
    threshold will be set to it.
upper : float or array_like, default None
    Maximum threshold value. All values above this
    threshold will be set to it.
axis : int or str axis name, optional
    Align object with lower and upper along the given axis.
inplace : bool, default False
    Whether to perform the operation in place on the data.
*args, **kwargs
    Additional keywords have no effect but might be accepted
    for compatibility with numpy.

Returns
-------
Series or DataFrame or None
    Same type as calling object with the values outside the
    clip boundaries replaced or None if ``inplace=True``.

See Also
--------
Series.clip : Trim values at input threshold in series.
DataFrame.clip : Trim values at input threshold in dataframe.
numpy.clip : Clip (limit) the values in an array.

Examples
--------
>>> data = {'col_0': [9, -3, 0, -1, 5], 'col_1': [-2, -7, 6, 8, -5]}
>>> df = pd.DataFrame(data)
>>> df
   col_0  col_1
0      9     -2
1     -3     -7
2      0      6
3     -1      8
4      5     -5

Clips per column using lower and upper thresholds:

>>> df.clip(-4, 6)
   col_0  col_1
0      6     -2
1     -3     -4
2      0      6
3     -1      6
4      5     -4

Clips using specific lower and upper thresholds per column element:

>>> t = pd.Series([2, -4, -1, 6, 3])
>>> t
0    2
1   -4
2   -1
3    6
4    3
dtype: int64

>>> df.clip(t, t + 4, axis=0)
   col_0  col_1
0      6      2
1     -3     -4
2      0      3
3      6      8
4      5      3
File:      ~/miniconda3/lib/python3.8/site-packages/pandas/core/generic.py
Type:      method

In [30]:
df = pd.Series([4,4,4,6,8,4,10,15,6,15,15])
df.duplicated()

0     False
1      True
2      True
3     False
4     False
5      True
6     False
7     False
8      True
9      True
10     True
dtype: bool

In [31]:
# 5 rows max by default
print(ser1.head(3))
print(ser1.tail(3))

0    12
1    34
2    56
dtype: int64
12     99
13    100
14     23
dtype: int64

In [32]:
print(ser1.index)
print(ser3.index)
print(ser1.index.tolist())
print(ser3.index.tolist())
print(ser3.tolist())

RangeIndex(start=0, stop=15, step=1)
Index(['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 0, 'j', 23, 2, 'word_idx', 'z',
       1],
      dtype='object')
[0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14]
['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 0, 'j', 23, 2, 'word_idx', 'z', 1]
[12, 34, 56, 32, 12, 3, 4, 57, 54, 46, 56, 78, 99, 100, 23]

In [33]:
import os

In [34]:
os.getcwd()

'/home/sharan/projects/al/pds'

In [35]:
ser3.to_csv("ser3.csv")

## DataFrames

In [36]:
df = pd.read_csv('./sosurveydataset/survey_results_public.csv')
# here we can write second param as <index_col='Respondent'> as it is eligible for being index. 
# we can also provide normally ext idx as <index=[..,..,..,..,......]>

In [76]:
pd.set_option('display.max_columns', 12)
pd.set_option('display.max_rows', 10)

In [77]:
df

,Respondent,MainBranch,Hobbyist,Age,Age1stCode,CompFreq,...,WebframeDesireNextYear,WebframeWorkedWith,WelcomeChange,WorkWeekHrs,YearsCode,YearsCodePro
0,1.0,I am a developer by profession,Yes,NaN,13,Monthly,...,ASP.NET Core,ASP.NET;ASP.NET Core,Just as welcome now as I felt last year,50.0,36,27
1,2.0,I am a developer by profession,No,NaN,19,NaN,...,NaN,NaN,Somewhat more welcome now than last year,NaN,7,4
2,3.0,I code primarily as a hobby,Yes,NaN,15,NaN,...,NaN,NaN,Somewhat more welcome now than last year,NaN,4,NaN
3,4.0,I am a developer by profession,Yes,25.0,18,NaN,...,NaN,NaN,Somewhat less welcome now than last year,40.0,7,4
4,5.0,"I used to be a developer by profession, but no...",Yes,31.0,16,NaN,...,Django;Ruby on Rails,Ruby on Rails,Just as welcome now as I felt last year,NaN,15,8
...,...,...,...,...,...,...,...,...,...,...,...,...,...
64456,64858.0,NaN,Yes,NaN,16,NaN,...,NaN,NaN,NaN,NaN,10,Less than 1 year
64457,64867.0,NaN,Yes,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN
64458,64898.0,NaN,Yes,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN
64459,64925.0,NaN,Yes,NaN,NaN,NaN,...,Angular;Angular.js;React.js,NaN,NaN,NaN,NaN,NaN
64460,65112.0,NaN,Yes,NaN,NaN,NaN,...,ASP.NET Core;jQuery,Angular;Angular.js;ASP.NET Core;jQuery,NaN,NaN,NaN,NaN

In [39]:
df.info()
# 1. Row - 32 entries with 0 - 31 and Data columns (total 15 columns)
# 2. All columns - followed by it's data types
        # object - strings
        # number of non missing values in that column
# 3. Freq table of the data types

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 64461 entries, 0 to 64460
Data columns (total 61 columns):
 #   Column                        Non-Null Count  Dtype
---  ------                        --------------  -----
 0   Respondent                    64461 non-null  int64
 1   MainBranch                    64162 non-null  object
 2   Hobbyist                      64416 non-null  object
 3   Age                           45446 non-null  float64
 4   Age1stCode                    57900 non-null  object
 5   CompFreq                      40069 non-null  object
 6   CompTotal                     34826 non-null  float64
 7   ConvertedComp                 34756 non-null  float64
 8   Country                       64072 non-null  object
 9   CurrencyDesc                  45472 non-null  object
 10  CurrencySymbol                45472 non-null  object
 11  DatabaseDesireNextYear        44070 non-null  object
 12  DatabaseWorkedWith            49537 non-null  object
 13  DevType                       49370 non-null  object
 14  EdLevel                       57431 non-null  object
 15  Employment                    63854 non-null  object
 16  Ethnicity                     45948 non-null  object
 17  Gender                        50557 non-null  object
 18  JobFactors                    49349 non-null  object
 19  JobSat                        45194 non-null  object
 20  JobSeek                       51727 non-null  object
 21  LanguageDesireNextYear        54113 non-null  object
 22  LanguageWorkedWith            57378 non-null  object
 23  MiscTechDesireNextYear        42379 non-null  object
 24  MiscTechWorkedWith            40314 non-null  object
 25  NEWCollabToolsDesireNextYear  47287 non-null  object
 26  NEWCollabToolsWorkedWith      52883 non-null  object
 27  NEWDevOps                     42686 non-null  object
 28  NEWDevOpsImpt                 41732 non-null  object
 29  NEWEdImpt                     48465 non-null  object
 30  NEWJobHunt                    42286 non-null  object
 31  NEWJobHuntResearch            41022 non-null  object
 32  NEWLearn                      56156 non-null  object
 33  NEWOffTopic                   50804 non-null  object
 34  NEWOnboardGood                42623 non-null  object
 35  NEWOtherComms                 57205 non-null  object
 36  NEWOvertime                   43231 non-null  object
 37  NEWPurchaseResearch           37321 non-null  object
 38  NEWPurpleLink                 54803 non-null  object
 39  NEWSOSites                    58275 non-null  object
 40  NEWStuck                      54983 non-null  object
 41  OpSys                         56228 non-null  object
 42  OrgSize                       44334 non-null  object
 43  PlatformDesireNextYear        50605 non-null  object
 44  PlatformWorkedWith            53843 non-null  object
 45  PurchaseWhat                  39364 non-null  object
 46  Sexuality                     43992 non-null  object
 47  SOAccount                     56805 non-null  object
 48  SOComm                        56476 non-null  object
 49  SOPartFreq                    46792 non-null  object
 50  SOVisitFreq                   56970 non-null  object
 51  SurveyEase                    51802 non-null  object
 52  SurveyLength                  51701 non-null  object
 53  Trans                         49345 non-null  object
 54  UndergradMajor                50995 non-null  object
 55  WebframeDesireNextYear        40024 non-null  object
 56  WebframeWorkedWith            42279 non-null  object
 57  WelcomeChange                 52683 non-null  object
 58  WorkWeekHrs                   41151 non-null  float64
 59  YearsCode                     57684 non-null  object
 60  YearsCodePro                  46349 non-null  object
dtypes: float64(4), int64(1), object(56)
memory usage: 30.0+ MB

In [40]:
df.columns.tolist() # there is nothing like df.rows method

['Respondent',
 'MainBranch',
 'Hobbyist',
 'Age',
 'Age1stCode',
 'CompFreq',
 'CompTotal',
 'ConvertedComp',
 'Country',
 'CurrencyDesc',
 'CurrencySymbol',
 'DatabaseDesireNextYear',
 'DatabaseWorkedWith',
 'DevType',
 'EdLevel',
 'Employment',
 'Ethnicity',
 'Gender',
 'JobFactors',
 'JobSat',
 'JobSeek',
 'LanguageDesireNextYear',
 'LanguageWorkedWith',
 'MiscTechDesireNextYear',
 'MiscTechWorkedWith',
 'NEWCollabToolsDesireNextYear',
 'NEWCollabToolsWorkedWith',
 'NEWDevOps',
 'NEWDevOpsImpt',
 'NEWEdImpt',
 'NEWJobHunt',
 'NEWJobHuntResearch',
 'NEWLearn',
 'NEWOffTopic',
 'NEWOnboardGood',
 'NEWOtherComms',
 'NEWOvertime',
 'NEWPurchaseResearch',
 'NEWPurpleLink',
 'NEWSOSites',
 'NEWStuck',
 'OpSys',
 'OrgSize',
 'PlatformDesireNextYear',
 'PlatformWorkedWith',
 'PurchaseWhat',
 'Sexuality',
 'SOAccount',
 'SOComm',
 'SOPartFreq',
 'SOVisitFreq',
 'SurveyEase',
 'SurveyLength',
 'Trans',
 'UndergradMajor',
 'WebframeDesireNextYear',
 'WebframeWorkedWith',
 'WelcomeChange',
 'WorkWeekHrs',
 'YearsCode',
 'YearsCodePro']

In [41]:
df.describe()   # cols only with numerical values will be taken into cinsideration. Rows with NaN will be excluded.

         Respondent           Age      CompTotal  ConvertedComp   WorkWeekHrs
count  64461.000000  45446.000000   3.482600e+04   3.475600e+04  41151.000000
mean   32554.079738     30.834111  3.190464e+242   1.037561e+05     40.782174
std    18967.442360      9.585392            inf   2.268853e+05     17.816383
min        1.000000      1.000000   0.000000e+00   0.000000e+00      1.000000
25%    16116.000000     24.000000   2.000000e+04   2.464800e+04     40.000000
50%    32231.000000     29.000000   6.300000e+04   5.404900e+04     40.000000
75%    49142.000000     35.000000   1.250000e+05   9.500000e+04     44.000000
max    65639.000000    279.000000  1.111111e+247   2.000000e+06    475.000000

In [42]:
# for dataframes when used with loc or iloc, rows and cols both are required inside []
# For using loc and iloc, it's nesessary to pass both column and row
# [r,c] -> left of comma - row indexes/conditions and right is for column names

df.loc[0:15,['Respondent', 'Age', 'CompTotal']] # except idx, everything is compulsory

    Respondent   Age  CompTotal
0            1   NaN        NaN
1            2   NaN        NaN
2            3   NaN        NaN
3            4  25.0        NaN
4            5  31.0        NaN
..         ...   ...        ...
11          12  49.0     1100.0
12          13  53.0     3000.0
13          14  27.0    66000.0
14          15   NaN        NaN
15          16  45.0     7000.0

[16 rows x 3 columns]

In [43]:
# Try to extract columns

# 1. Use of the . operator
print(df.YearsCode)
print(df['YearsCode'])  # prefer [] over . because if col named count, it will overridden by the method count
print(df[['Respondent', 'Age', 'CompTotal']])

0         36
1          7
2          4
3          7
4         15
        ...
64456     10
64457    NaN
64458    NaN
64459    NaN
64460    NaN
Name: YearsCode, Length: 64461, dtype: object
0         36
1          7
2          4
3          7
4         15
        ...
64456     10
64457    NaN
64458    NaN
64459    NaN
64460    NaN
Name: YearsCode, Length: 64461, dtype: object
       Respondent   Age  CompTotal
0               1   NaN        NaN
1               2   NaN        NaN
2               3   NaN        NaN
3               4  25.0        NaN
4               5  31.0        NaN
...           ...   ...        ...
64456       64858   NaN        NaN
64457       64867   NaN        NaN
64458       64898   NaN        NaN
64459       64925   NaN        NaN
64460       65112   NaN        NaN

[64461 rows x 3 columns]

In [44]:
#  pd.to_numeric(ser1)        any data type to numbers
#  pd.to_datetime()       suitable characters to date type
# --------------------------------------------------------------
# dataframe.astype(str)   anything to string (object type)
# dataframe.astype(bool)  anything to bool

In [45]:
df['Age'] = pd.to_numeric(df.Age)

In [46]:
df['CompTotal'] = df.CompTotal.astype(bool)

In [47]:
df.CompTotal

0        True
1        True
2        True
3        True
4        True
         ...
64456    True
64457    True
64458    True
64459    True
64460    True
Name: CompTotal, Length: 64461, dtype: bool

In [48]:
df.Respondent = df['Respondent'].astype(float)

In [49]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 64461 entries, 0 to 64460
Data columns (total 61 columns):
 #   Column                        Non-Null Count  Dtype
---  ------                        --------------  -----
 0   Respondent                    64461 non-null  float64
 1   MainBranch                    64162 non-null  object
 2   Hobbyist                      64416 non-null  object
 3   Age                           45446 non-null  float64
 4   Age1stCode                    57900 non-null  object
 5   CompFreq                      40069 non-null  object
 6   CompTotal                     64461 non-null  bool
 7   ConvertedComp                 34756 non-null  float64
 8   Country                       64072 non-null  object
 9   CurrencyDesc                  45472 non-null  object
 10  CurrencySymbol                45472 non-null  object
 11  DatabaseDesireNextYear        44070 non-null  object
 12  DatabaseWorkedWith            49537 non-null  object
 13  DevType                       49370 non-null  object
 14  EdLevel                       57431 non-null  object
 15  Employment                    63854 non-null  object
 16  Ethnicity                     45948 non-null  object
 17  Gender                        50557 non-null  object
 18  JobFactors                    49349 non-null  object
 19  JobSat                        45194 non-null  object
 20  JobSeek                       51727 non-null  object
 21  LanguageDesireNextYear        54113 non-null  object
 22  LanguageWorkedWith            57378 non-null  object
 23  MiscTechDesireNextYear        42379 non-null  object
 24  MiscTechWorkedWith            40314 non-null  object
 25  NEWCollabToolsDesireNextYear  47287 non-null  object
 26  NEWCollabToolsWorkedWith      52883 non-null  object
 27  NEWDevOps                     42686 non-null  object
 28  NEWDevOpsImpt                 41732 non-null  object
 29  NEWEdImpt                     48465 non-null  object
 30  NEWJobHunt                    42286 non-null  object
 31  NEWJobHuntResearch            41022 non-null  object
 32  NEWLearn                      56156 non-null  object
 33  NEWOffTopic                   50804 non-null  object
 34  NEWOnboardGood                42623 non-null  object
 35  NEWOtherComms                 57205 non-null  object
 36  NEWOvertime                   43231 non-null  object
 37  NEWPurchaseResearch           37321 non-null  object
 38  NEWPurpleLink                 54803 non-null  object
 39  NEWSOSites                    58275 non-null  object
 40  NEWStuck                      54983 non-null  object
 41  OpSys                         56228 non-null  object
 42  OrgSize                       44334 non-null  object
 43  PlatformDesireNextYear        50605 non-null  object
 44  PlatformWorkedWith            53843 non-null  object
 45  PurchaseWhat                  39364 non-null  object
 46  Sexuality                     43992 non-null  object
 47  SOAccount                     56805 non-null  object
 48  SOComm                        56476 non-null  object
 49  SOPartFreq                    46792 non-null  object
 50  SOVisitFreq                   56970 non-null  object
 51  SurveyEase                    51802 non-null  object
 52  SurveyLength                  51701 non-null  object
 53  Trans                         49345 non-null  object
 54  UndergradMajor                50995 non-null  object
 55  WebframeDesireNextYear        40024 non-null  object
 56  WebframeWorkedWith            42279 non-null  object
 57  WelcomeChange                 52683 non-null  object
 58  WorkWeekHrs                   41151 non-null  float64
 59  YearsCode                     57684 non-null  object
 60  YearsCodePro                  46349 non-null  object
dtypes: bool(1), float64(4), object(56)
memory usage: 29.6+ MB

In [50]:
# date
# day:          %d
# dayofweek:    %w
# weekdayabbr:  %a
# weekdayfulln  %A
# monthnum      %m
# monthnameabbr %b
# monthnamefull %B
# yearwocent    %y
# yearwcent     %Y

In [51]:
date1 = "25Feb2018"
date2 = "1/1/18"
date3 = "01/23/1986"
date4 = "Sunday 25 Feb 2018"

In [52]:
pd.to_datetime(date1,format="%d%b%Y")

Timestamp('2018-02-25 00:00:00')

In [53]:
d = pd.to_datetime(date3,format="%m/%d/%Y")
print(d)

1986-01-23 00:00:00

In [54]:
type(d)

pandas._libs.tslibs.timestamps.Timestamp

##  Corey's

In [119]:
people = {
    'first' : ['Corey', 'Jane', 'John'],
    'Last' : ['Schafer', 'Doe', 'Doe'],
    'email' : ['CoreySchafer@gmail.com', 'JaneDoe@gmail.com', 'JohnDoe@gmail.com']
}

In [120]:
df1 = pd.DataFrame(people)

In [121]:
df1.shape    # gives dimension. NOTE, its w/o brackets

(3, 3)

In [122]:
df1

   first     Last                   email
0  Corey  Schafer  CoreySchafer@gmail.com
1   Jane      Doe       JaneDoe@gmail.com
2   John      Doe       JohnDoe@gmail.com

In [123]:
# index to dataframe

df1.loc[0] # or df.iloc[0], both will give same output. Here, for single row, column idx is idx of the output

first                     Corey
Last                    Schafer
email    CoreySchafer@gmail.com
Name: 0, dtype: object

In [124]:
# for multiple rows if to be fetched, then normal output is observed

df1.iloc[[1,2], 0]   # from " , 0" is optional. For multiple rows/cols [] is required, but for single row/col only that row's/col's idx is required...  Works both for iloc and loc, but remember that loc wont take int idx if ext idx is defined. Here col headers are ext idx which are implicitly defined.
# Syntax:       .[i]loc[[row[,row,row,...]][,[col[,col,col,...]] ]

1    Jane
2    John
Name: first, dtype: object

In [125]:
df1.columns

Index(['first', 'Last', 'email'], dtype='object')

In [126]:
df['Hobbyist'].value_counts()   # gives the frequency of the unique values

Yes    50388
No     14028
Name: Hobbyist, dtype: int64

In [127]:
# making the index col by one series of dataframe

print(df1)
print(df1.index)
df1.set_index('email')
print(df1)   # inplace change didn't took place
print(df1.index)
df1.set_index('email', inplace=True)
print(df1)
print(df1.index)
df1.reset_index(inplace=True)
print(df1)
print(df1.index)

   first     Last                   email
0  Corey  Schafer  CoreySchafer@gmail.com
1   Jane      Doe       JaneDoe@gmail.com
2   John      Doe       JohnDoe@gmail.com
RangeIndex(start=0, stop=3, step=1)
   first     Last                   email
0  Corey  Schafer  CoreySchafer@gmail.com
1   Jane      Doe       JaneDoe@gmail.com
2   John      Doe       JohnDoe@gmail.com
RangeIndex(start=0, stop=3, step=1)
                        first     Last
email
CoreySchafer@gmail.com  Corey  Schafer
JaneDoe@gmail.com        Jane      Doe
JohnDoe@gmail.com        John      Doe
Index(['CoreySchafer@gmail.com', 'JaneDoe@gmail.com', 'JohnDoe@gmail.com'], dtype='object', name='email')
                    email  first     Last
0  CoreySchafer@gmail.com  Corey  Schafer
1       JaneDoe@gmail.com   Jane      Doe
2       JohnDoe@gmail.com   John      Doe
RangeIndex(start=0, stop=3, step=1)

In [128]:
# sorting rows based on index
df2=pd.read_csv('./sosurveydataset/survey_results_schema.csv', index_col='Column')

In [129]:
df2

                                                         QuestionText
Column
Respondent          Randomized respondent ID number (not in order ...
MainBranch          Which of the following options best describes ...
Hobbyist                                      Do you code as a hobby?
Age                 What is your age (in years)? If you prefer not...
Age1stCode          At what age did you write your first line of c...
...                                                               ...
WebframeWorkedWith  Which web frameworks have you done extensive d...
WelcomeChange       Compared to last year, how welcome do you feel...
WorkWeekHrs         On average, how many hours per week do you wor...
YearsCode           Including any education, how many years have y...
YearsCodePro        NOT including education, how many years have y...

[61 rows x 1 columns]

In [130]:
df2.sort_index()    # this didn't took inplace change. For that, use <inplace=True> as parameter to the sort_index() method

                                                         QuestionText
Column
Age                 What is your age (in years)? If you prefer not...
Age1stCode          At what age did you write your first line of c...
CompFreq             Is that compensation weekly, monthly, or yearly?
CompTotal           What is your current total compensation (salar...
ConvertedComp       Salary converted to annual USD salaries using ...
...                                                               ...
WebframeWorkedWith  Which web frameworks have you done extensive d...
WelcomeChange       Compared to last year, how welcome do you feel...
WorkWeekHrs         On average, how many hours per week do you wor...
YearsCode           Including any education, how many years have y...
YearsCodePro        NOT including education, how many years have y...

[61 rows x 1 columns]

In [131]:
df.loc[df['ConvertedComp'] > 70000, ['ConvertedComp', 'Country']]    # comparision happens on series

       ConvertedComp         Country
7           116000.0   United States
15          108576.0  United Kingdom
16           79000.0   United States
17         1260000.0   United States
18           83400.0   United States
...              ...             ...
64113       225000.0   United States
64116       150000.0   United States
64127       140000.0   United States
64129       150000.0   United States
64141       129718.0         Germany

[13178 rows x 2 columns]

In [132]:
countries = ['United States', 'India', 'United Kingdom', 'Germany', 'Canada']
filt = df['Country'].isin(countries)
df.loc[filt]

,Respondent,MainBranch,Hobbyist,Age,Age1stCode,CompFreq,...,WebframeDesireNextYear,WebframeWorkedWith,WelcomeChange,WorkWeekHrs,YearsCode,YearsCodePro
0,1.0,I am a developer by profession,Yes,NaN,13,Monthly,...,ASP.NET Core,ASP.NET;ASP.NET Core,Just as welcome now as I felt last year,50.0,36,27
1,2.0,I am a developer by profession,No,NaN,19,NaN,...,NaN,NaN,Somewhat more welcome now than last year,NaN,7,4
4,5.0,"I used to be a developer by profession, but no...",Yes,31.0,16,NaN,...,Django;Ruby on Rails,Ruby on Rails,Just as welcome now as I felt last year,NaN,15,8
5,6.0,I am a developer by profession,No,NaN,14,NaN,...,React.js,NaN,NaN,NaN,6,4
6,7.0,I am a developer by profession,Yes,NaN,18,Monthly,...,NaN,NaN,A lot more welcome now than last year,NaN,6,4
...,...,...,...,...,...,...,...,...,...,...,...,...,...
64441,62834.0,NaN,Yes,17.0,10,NaN,...,NaN,NaN,Somewhat more welcome now than last year,NaN,7,NaN
64442,62954.0,NaN,Yes,NaN,NaN,NaN,...,NaN,ASP.NET;ASP.NET Core;Django;jQuery;Symfony;Vue.js,NaN,NaN,NaN,NaN
64443,63077.0,NaN,Yes,NaN,20,NaN,...,NaN,NaN,NaN,NaN,4,NaN
64452,64236.0,NaN,Yes,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN
64456,64858.0,NaN,Yes,NaN,16,NaN,...,NaN,NaN,NaN,NaN,10,Less than 1 year

In [133]:
filt = df['LanguageWorkedWith'].str.contains('Python', na=False)
df.loc[filt, 'LanguageWorkedWith']

2                                 Objective-C;Python;Swift
7                                               Python;SQL
9                      HTML/CSS;Java;JavaScript;Python;SQL
12                                     C;JavaScript;Python
14        Bash/Shell/PowerShell;C;HTML/CSS;Java;Python;SQL
                               ...
64433    Bash/Shell/PowerShell;HTML/CSS;JavaScript;Perl...
64438       C++;HTML/CSS;JavaScript;Python;Ruby;TypeScript
64443              C++;HTML/CSS;Java;JavaScript;Python;SQL
64446    Bash/Shell/PowerShell;C;C#;C++;HTML/CSS;Java;J...
64457    Assembly;Bash/Shell/PowerShell;C;C#;C++;Dart;G...
Name: LanguageWorkedWith, Length: 25287, dtype: object

## Updating column names of DFs

In [134]:
# changing all columns name inplace by default
print(df1)
df1.columns = ['Email', 'First Name', 'Last Name'] # this methos requires all column of DFs, even if all name changes are not required
print(df1.columns)
df1.columns = [x.upper() for x in df1.columns]
print(df1.columns)
df1.columns = df1.columns.str.replace(' ','-')
print(df1.columns)
df1.columns = [x.lower().replace('-','_') for x in df1.columns]

                    email  first     Last
0  CoreySchafer@gmail.com  Corey  Schafer
1       JaneDoe@gmail.com   Jane      Doe
2       JohnDoe@gmail.com   John      Doe
Index(['Email', 'First Name', 'Last Name'], dtype='object')
Index(['EMAIL', 'FIRST NAME', 'LAST NAME'], dtype='object')
Index(['EMAIL', 'FIRST-NAME', 'LAST-NAME'], dtype='object')

In [135]:
df1.columns

Index(['email', 'first_name', 'last_name'], dtype='object')

In [136]:
# changing specific column name with explicitly mentioning inplace parameter
df1.rename(columns={'first_name':'first', 'last_name':'last'}, inplace=True)
df1

                    email  first     last
0  CoreySchafer@gmail.com  Corey  Schafer
1       JaneDoe@gmail.com   Jane      Doe
2       JohnDoe@gmail.com   John      Doe

## Updating data in DFs

In [139]:
# changing single row and all of its column vaue, i.e., entirely whole row
df1.loc[2] = ['johnsmith@gmail.com', 'John', 'Smith']
df1

                    email  first     last
0  CoreySchafer@gmail.com  Corey  Schafer
1       JaneDoe@gmail.com   Jane      Doe
2     johnsmith@gmail.com   John    Smith

In [140]:
# changing specific columns for a given row
df1.loc[1, ['email', 'last']] = ['JaneDoodle@email.com', 'Doodle']  # Also, for only single vale to be change, list is not required in LHS or RHS
df1
# one can also use df1.[filt, col(s)] = <[>col(s)<]>

                    email  first     last
0  CoreySchafer@gmail.com  Corey  Schafer
1    JaneDoodle@email.com   Jane   Doodle
2     johnsmith@gmail.com   John    Smith

In [143]:
df1['email'] = df1['email'].str.lower()
df1

                    email  first     last
0  coreyschafer@gmail.com  Corey  Schafer
1    janedoodle@email.com   Jane   Doodle
2     johnsmith@gmail.com   John    Smith

### apply
used for calling function on every values of our data structure. Can be applied on Series as well as on DFs. NOT inplace.

In [145]:
df1.email.apply(len)

0    22
1    20
2    19
Name: email, dtype: int64

In [147]:
def update_email(email):
    return email.upper()

df1['email'] = df1.email.apply(update_email)

In [149]:
df1

                    email  first     last
0  COREYSCHAFER@GMAIL.COM  Corey  Schafer
1    JANEDOODLE@EMAIL.COM   Jane   Doodle
2     JOHNSMITH@GMAIL.COM   John    Smith

In [150]:
df1['email'] = df1.email.apply(lambda x : x.lower())
print(df1)

                    email  first     last
0  coreyschafer@gmail.com  Corey  Schafer
1    janedoodle@email.com   Jane   Doodle
2     johnsmith@gmail.com   John    Smith

In [152]:
# apply on dataframes
print(df1.apply(len))   # axis is set to rows by default
print(df1.apply(len, axis = 'columns'))

email    3
first    3
last     3
dtype: int64
0    3
1    3
2    3
dtype: int64

In [153]:
# finding minimum value from each series of the dataframe
df1.apply(pd.Series.min)

email    coreyschafer@gmail.com
first                     Corey
last                     Doodle
dtype: object

In [154]:
# while lambda function runs on the Series by default. We dont need to explicitly specify the pd.seried while using the dataframe with apply
df1.apply(lambda x : x.min())   # look at it. X is itself a series, and we are finding the minimum from every series. This is useful for numerical analysis.

email    coreyschafer@gmail.com
first                     Corey
last                     Doodle
dtype: object

### applymap
It works only on the dataframes. It does not work on the series data structures. It is used to run functions on every element of the dataframes. NOT inplace.

In [159]:
print(df1.applymap(len))
print(df1.applymap(str.lower))
df1

   email  first  last
0     22      5     7
1     20      4     6
2     19      4     5
                    email  first     last
0  coreyschafer@gmail.com  corey  schafer
1    janedoodle@email.com   jane   doodle
2     johnsmith@gmail.com   john    smith

                    email  first     last
0  coreyschafer@gmail.com  Corey  Schafer
1    janedoodle@email.com   Jane   Doodle
2     johnsmith@gmail.com   John    Smith

### map
It only works on a series. It is used to substitute each value in the series with another value. NOT inplace.

In [160]:
df1['first'].map({'Corey':'kirrr', 'Jane':'girrrh'})    # those values which are not mentioned in the dictionary, will be turned into NaN.

0     kirrr
1    girrrh
2       NaN
Name: first, dtype: object

### replace
for handling the error of the map that gives NaN, we use replace. Here, only specfied values will get altered. NOT inplace.

In [161]:
df1['first'].replace({'Corey':'kirrr', 'Jane':'girrrh'})

0     kirrr
1    girrrh
2      John
Name: first, dtype: object

In [173]:
# add columns
df1['full_name'] = df1['first'] + ' ' + df1['last']
df1

                    email  first     last      full_name
0  coreyschafer@gmail.com  Corey  Schafer  Corey Schafer
1    janedoodle@email.com   Jane   Doodle    Jane Doodle
2     johnsmith@gmail.com   John    Smith     John Smith

In [174]:
# removing cols
df1.drop(columns='full_name', inplace=True)   # or, columns=['col1', 'col2', ...]
df1

                    email  first     last
0  coreyschafer@gmail.com  Corey  Schafer
1    janedoodle@email.com   Jane   Doodle
2     johnsmith@gmail.com   John    Smith

In [175]:
df1['full_name'] = df1['first'] + ' ' + df1['last']

# split column

df1[['firstname', 'lastname']] = df1['full_name'].str.split(' ',expand = True)
df1

                    email  first     last      full_name firstname lastname
0  coreyschafer@gmail.com  Corey  Schafer  Corey Schafer     Corey  Schafer
1    janedoodle@email.com   Jane   Doodle    Jane Doodle      Jane   Doodle
2     johnsmith@gmail.com   John    Smith     John Smith      John    Smith

### removing or adding rows of data

append doesn't have inplace parameter. Hence for permanent change, use df1= df1.appen......................

In [180]:
# adding row of data. This is NOT INPLACE change
df1.append({'firstname':'sharan'}, ignore_index=True)
df1.append({'firstname':['wubba', 'lubba', 'dub', 'dubb']}, ignore_index=True)

,email,first,last,full_name,firstname,lastname
0,coreyschafer@gmail.com,Corey,Schafer,Corey Schafer,Corey,Schafer
1,janedoodle@email.com,Jane,Doodle,Jane Doodle,Jane,Doodle
2,johnsmith@gmail.com,John,Smith,John Smith,John,Smith
3,NaN,NaN,NaN,NaN,"[wubba, lubba, dub, dubb]",NaN

In [182]:
ppl = {
    'first' : ['Tony', 'Steve'],
    'last' : ['Stark', 'Rogers'],
    'email' : ['notyourkakkar@avengers.com', 'itsyourcap@avengers.com']
}

In [184]:
ndf = pd.DataFrame(ppl)

In [185]:
df1 = df1.append(ndf, ignore_index=True)

In [186]:
df1

,email,first,last,full_name,firstname,lastname
0,coreyschafer@gmail.com,Corey,Schafer,Corey Schafer,Corey,Schafer
1,janedoodle@email.com,Jane,Doodle,Jane Doodle,Jane,Doodle
2,johnsmith@gmail.com,John,Smith,John Smith,John,Smith
3,notyourkakkar@avengers.com,Tony,Stark,NaN,NaN,NaN
4,itsyourcap@avengers.com,Steve,Rogers,NaN,NaN,NaN

In [188]:
# removing rows
df1.drop(index=4)   # NOT INPLACE

,email,first,last,full_name,firstname,lastname
0,coreyschafer@gmail.com,Corey,Schafer,Corey Schafer,Corey,Schafer
1,janedoodle@email.com,Jane,Doodle,Jane Doodle,Jane,Doodle
2,johnsmith@gmail.com,John,Smith,John Smith,John,Smith
3,notyourkakkar@avengers.com,Tony,Stark,NaN,NaN,NaN

In [193]:
filt = df1['last'] == 'Doodle'
print(filt)
df1.drop(index=df1[filt].index)

0    False
1     True
2    False
3    False
4    False
Name: last, dtype: bool

,email,first,last,full_name,firstname,lastname
0,coreyschafer@gmail.com,Corey,Schafer,Corey Schafer,Corey,Schafer
2,johnsmith@gmail.com,John,Smith,John Smith,John,Smith
3,notyourkakkar@avengers.com,Tony,Stark,NaN,NaN,NaN
4,itsyourcap@avengers.com,Steve,Rogers,NaN,NaN,NaN

### Sorting data in pandas

pass parameter as inplace=True for permanent shufflibg of value

In [196]:
df1

,email,first,last,full_name,firstname,lastname
0,coreyschafer@gmail.com,Corey,Schafer,Corey Schafer,Corey,Schafer
1,janedoodle@email.com,Jane,Doodle,Jane Doodle,Jane,Doodle
2,johnsmith@gmail.com,John,Smith,John Smith,John,Smith
3,notyourkakkar@avengers.com,Tony,Stark,NaN,NaN,NaN
4,itsyourcap@avengers.com,Steve,Rogers,NaN,NaN,NaN

In [197]:
df1.sort_values(by = 'last')

,email,first,last,full_name,firstname,lastname
1,janedoodle@email.com,Jane,Doodle,Jane Doodle,Jane,Doodle
4,itsyourcap@avengers.com,Steve,Rogers,NaN,NaN,NaN
0,coreyschafer@gmail.com,Corey,Schafer,Corey Schafer,Corey,Schafer
2,johnsmith@gmail.com,John,Smith,John Smith,John,Smith
3,notyourkakkar@avengers.com,Tony,Stark,NaN,NaN,NaN

In [198]:
df1.sort_values(by = ['last', 'first'], ascending = False)

,email,first,last,full_name,firstname,lastname
3,notyourkakkar@avengers.com,Tony,Stark,NaN,NaN,NaN
2,johnsmith@gmail.com,John,Smith,John Smith,John,Smith
0,coreyschafer@gmail.com,Corey,Schafer,Corey Schafer,Corey,Schafer
4,itsyourcap@avengers.com,Steve,Rogers,NaN,NaN,NaN
1,janedoodle@email.com,Jane,Doodle,Jane Doodle,Jane,Doodle

In [200]:
df1.sort_values(by = ['first', 'last'], ascending = [False, True])

,email,first,last,full_name,firstname,lastname
3,notyourkakkar@avengers.com,Tony,Stark,NaN,NaN,NaN
4,itsyourcap@avengers.com,Steve,Rogers,NaN,NaN,NaN
2,johnsmith@gmail.com,John,Smith,John Smith,John,Smith
1,janedoodle@email.com,Jane,Doodle,Jane Doodle,Jane,Doodle
0,coreyschafer@gmail.com,Corey,Schafer,Corey Schafer,Corey,Schafer

In [201]:
# sorting by index. It is used to restore the DF in the original order of rows as per the internal index
df1.sort_index()

,email,first,last,full_name,firstname,lastname
0,coreyschafer@gmail.com,Corey,Schafer,Corey Schafer,Corey,Schafer
1,janedoodle@email.com,Jane,Doodle,Jane Doodle,Jane,Doodle
2,johnsmith@gmail.com,John,Smith,John Smith,John,Smith
3,notyourkakkar@avengers.com,Tony,Stark,NaN,NaN,NaN
4,itsyourcap@avengers.com,Steve,Rogers,NaN,NaN,NaN

In [202]:
#viewing just sorted series of a dataframe
df1['email'].sort_values()

0        coreyschafer@gmail.com
4       itsyourcap@avengers.com
1          janedoodle@email.com
2           johnsmith@gmail.com
3    notyourkakkar@avengers.com
Name: email, dtype: object

In [203]:
# displaying Nth largest values...
# M1: df1[[col1, col2,....]].head(n)    where the dataframe is sorted
# M2: below
df['ConvertedComp'].nlargest(10)    # also there is nsmallest

121     2000000.0
123     2000000.0
191     2000000.0
663     2000000.0
697     2000000.0
722     2000000.0
816     2000000.0
982     2000000.0
1018    2000000.0
1032    2000000.0
Name: ConvertedComp, dtype: float64

In [204]:
df.nlargest(10, 'ConvertedComp')    # also there is nsmallest

,Respondent,MainBranch,Hobbyist,Age,Age1stCode,CompFreq,...,WebframeDesireNextYear,WebframeWorkedWith,WelcomeChange,WorkWeekHrs,YearsCode,YearsCodePro
121,123.0,I am a developer by profession,Yes,26.0,12,Weekly,...,Flask;jQuery;React.js,Spring,Just as welcome now as I felt last year,36.0,8,3
123,125.0,"I am not primarily a developer, but I write co...",Yes,41.0,30,Monthly,...,NaN,NaN,Just as welcome now as I felt last year,40.0,11,11
191,193.0,I am a developer by profession,Yes,29.0,16,Weekly,...,NaN,NaN,Just as welcome now as I felt last year,40.0,13,7
663,665.0,I am a developer by profession,Yes,24.0,13,Weekly,...,React.js,Express;React.js;Ruby on Rails,Just as welcome now as I felt last year,40.0,4,Less than 1 year
697,699.0,"I am not primarily a developer, but I write co...",Yes,39.0,16,Weekly,...,Angular;ASP.NET;ASP.NET Core;Express;Flask,NaN,NaN,40.0,5,2
722,724.0,"I am not primarily a developer, but I write co...",Yes,NaN,12,Weekly,...,NaN,React.js,Not applicable - I did not use Stack Overflow ...,40.0,3,3
816,818.0,"I am not primarily a developer, but I write co...",Yes,40.0,15,Weekly,...,Angular;Flask;Spring,NaN,Somewhat less welcome now than last year,40.0,25,2
982,986.0,I am a developer by profession,Yes,27.0,11,Weekly,...,Express;Laravel,Express;jQuery;Laravel,Just as welcome now as I felt last year,40.0,16,8
1018,1022.0,I am a developer by profession,Yes,34.0,16,Weekly,...,React.js,Angular;Angular.js;React.js;Vue.js,Just as welcome now as I felt last year,40.0,18,13
1032,1036.0,I am a developer by profession,Yes,26.0,11,Weekly,...,ASP.NET Core;Vue.js,Angular;ASP.NET;ASP.NET Core;Django;Express;Fl...,A lot more welcome now than last year,40.0,5,3